# Реализовать алгоритм перемешивания списка

import random

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]

random.shuffle(list)
print(list)